'use strict';


const TelegramBot = require('node-telegram-bot-api');
const token = '574054693:AAHb0jAvdeYGj8eofEi2_r5QztcQspnUegg';
const bot = new TelegramBot(token, {polling: true});


//Создаем клавиатуру бота
bot.onText(/\/start/, (msg) => {
    
bot.sendMessage(msg.chat.id, "Ласкаво просимо!", {
"reply_markup": {
    "keyboard": [["Загальнi вiдомостi", "Наша адреса"], ["Факультети", "Кафедри"],
    ["Перелік спеціальностей"], ["Ліцензований обсяг прийому до ХНЕУ"],  ["Конкурсні предмети УЦОЯО на бюджет и контракт"],
     ["Витяг з правил прийому до ХНЕУ ім. С. Кузнеця в 2018 році"]]
    }
});

bot.sendPhoto(msg.chat.id,"http://www.hneu.edu.ua/web/themes/hneu/images/header/header-down/logo.png" );    
});

bot.on('message', (msg) => {  
var contacts = "Наша адреса";
if (msg.text.indexOf(contacts) === 0) {
    bot.sendMessage(msg.chat.id, `
Participant Identification Code (PIC) S. KUZNETS KhNUE - 941523323
м. Харків, просп. Науки, 9-А, 61166 Україна
Тел.: (057)702 03 04
Факс: (057)702 07 17
Email:post@hneu.edu.ua Email:depnews@hneu.edu.ua
Приймальна комісія: (057)702-18-37)
        `);
}
var general_description = "Загальнi вiдомостi";
if (msg.text.indexOf(general_description) === 0) {
    bot.sendMessage(msg.chat.id, `
Загальний опис закладу
 
Харківський національний економічний університет імені Семена Кузнеця (ХНЕУ ім. С. Кузнеця) – правонаступник Харківського інженерно-економічного інституту – був заснований 22 жовтня 1930 року на базі промислового факультету Харківського інституту народного господарства. Його відкриття було викликано швидким розвитком машинобудівної, металургійної, хімічної, гірничої та інших галузей промисловості України та республік колишнього СРСР і зростанням потреб в економічних кадрах для промислових підприємств.
 
ХІЕІ готував інженерів-економістів для галузей важкої промисловості України: гірничої, металургійної, основної хімічної і коксохімічної, машинобудівної. З 1960-х рр. також фахівців для проектування і обслуговування автоматизованих систем управління виробництвом (АСУП). Розвинена важка промисловість Харківського регіону і Донбасу забезпечувала інституту базу виробничої практики, науково-дослідної роботи, працевлаштування випускників.
 
У 1948/1949 р. розпочато навчання студентів-іноземців з держав Східної Європи, з 1959 р. – громадян КНР; надалі географія прийому охоплювала більш 25 країн світу. У 1948 р. було організовано студентське наукове суспільство.
 
У 1950-і рр. групою вчених ХІЕІ під керівництвом О. Г. Лібермана були здійснені дослідження з вивчення виробництва 25 машинобудівних заводів Харкова і Харківської області. У ході досліджень були вироблені пропозиції, що згодом були покладені в основу економічної реформи 1965 р. (реформа Косигіна – Лібермана).
 
У кінці 1950-х - 1980-х рр. при ХІЕІ створюються спільні з відомствами проблемні науково-дослідні лабораторії. Зростає обсяг прикладних дослідницьких проектів, що виконувалися на замовлення підприємств. У 1970-ті рр. ХІЕІ проводив спільні дослідження та підтримував ділові контакти з більш як 30 науково-дослідними і проектними інститутами, а також іншими ВНЗ, дослідницькими організаціями, відомствами, науково-промисловими об'єднаннями. З 1988 р. розпочато підготовку фахівців для зовнішньоекономічної діяльності.
 
У 1994 році інститут отримав IV рівень державної акредитації вищих навчальних закладів і Постановою Кабінету Міністрів України від 20 квітня 1994 року був перетворений на Харківський державний економічний університет.
 
У 2004 році, відповідно до рішення Державної акредитаційної комісії (протокол №50 від 13.04.2004), університет підтвердив ІV рівень акредитації. Указом Президента України від 21 серпня 2004 року №956/2004 університету надано статус національного.
 
        `);
}
var faculties = "Факультети";
if (msg.text.indexOf(faculties) === 0) {
    bot.sendMessage(msg.chat.id, `
Факультет економіки і права
http://www.ep.hneu.edu.ua
Факультет менеджменту і маркетингу
http://www.ei.hneu.edu.ua/
Факультет міжнародних економічних відносин
http://www.mim.hneu.edu.ua
Факультет консалтингу і міжнародного бізнесу
http://www.kimb.hneu.edu.ua/
Фінансовий факультет
www.fin.hneu.edu.ua
Факультет підготовки іноземних громадян
fsf.hneu.edu.ua`);
}
var departments = "Кафедри";
if (msg.text.indexOf(departments) === 0) {
    bot.sendMessage(msg.chat.id, `
КАФЕДРЫ
ФАКУЛЬТЕТ КОНСАЛТИНГУ І МІЖНАРОДНОГО БІЗНЕСУ
Кафедра бухгалтерського обліку
http://kafacco.hneu.edu.ua/
Кафедра міжнародного бізнесу та економічного аналізу
http://www.ea.hneu.edu.ua
Кафедра вищої математики та економіко-математичних методів
kafmath@hneu.edu.ua
Кафедра економічного консалтингу
http://www.kia.hneu.edu.ua
Кафедра філософії та політології
kaffilosof@hneu.edu.ua
ФАКУЛЬТЕТ ФІНАНСОВИЙ
Кафедра фінансів
http://www.kaffin.hneu.edu.ua/
Кафедра управління фінансовими послугами
www.fin.hneu.edu.ua/?page_id=108
Кафедра банківської справи
www.banking.hneu.edu.ua
Кафедра митної справи та оподаткування
http://www.kaffinop.hneu.edu.ua/ 
ФАКУЛЬТЕТ МЕНЕДЖМЕНТУ І МАРКЕТИНГУ
Кафедра менеджменту
http://www.kafmng.hneu.edu.ua/main-ru/
Кафедра менеджменту і бізнесу
http://www.kmib.hneu.edu.ua
Кафедра економіки, управління підприємствами та логістики
http://www.eeml.hneu.edu.ua/
Кафедра економіки і маркетингу
http://www.eim.hneu.edu.ua/
Кафедра підприємницької діяльності
kafpd@ksue.edu.ua
ФАКУЛЬТЕТ ЕКОНОМІЧНОЇ ІНФОРМАТИКИ
Кафедра інформаційних систем
http://www.is.hneu.edu.ua/
Кафедра економічної кібернетики
http://www.ek.hneu.edu.ua/
Кафедра природоохоронних технологій, екології та безпеки життєдіяльності
http://www.bgd.hneu.edu.ua
Кафедра комп'ютерних систем і технологій
http://www.ksit.hneu.edu.ua/
Кафедра інформатики та комп'ютерної техніки
http://www.kafikt.hneu.edu.ua
Кафедра статистики та економічного прогнозування
http://www.stat.hneu.edu.ua/
ФАКУЛЬТЕТ ЕКОНОМІКИ І ПРАВА
Кафедра економіки підприємства та менеджменту
http://www.kafepm.hneu.edu.ua/
Кафедра економіки та соціальних наук
http://www.kafupep.hneu.edu.ua
Кафедра правового регулювання економіки
Кафедра державного управління, публічного адміністрування та регіональної економіки
cafpubladm.com
Кафедра управління соціальними комунікаціями
http://mediaprad.blogspot.com
http://www.kafusk.hneu.edu.ua
Кафедра педагогіки та іноземної філології
http://www.kafpif.hneu.edu.ua
ФАКУЛЬТЕТ МІЖНАРОДНИХ ЕКОНОМІЧНИХ ВІДНОСИН
Кафедра міжнародної економіки та менеджменту зовнішньоекономічної діяльності
kafzed@ksue.edu.ua
Кафедра іноземних мов та перекладу
Тел. +38 (057) 702-18-32, 3-83 (внутрішній)
Кафедра туризму
kaftour@hneu.edu.ua
ФАКУЛЬТЕТ ПІДГОТОВКИ ІНОЗЕМНИХ ГРОМАДЯН
Кафедра українознавства і мовної підготовки іноземних громадян
http://www.fsf.hneu.edu.ua/
Кафедра фізвиховання та спорт
www.kafsport.hneu.edu.ua
Кафедра політичної економії
http://economist.in.ua`);
}
var list_of_specialties = "Перелік спеціальностей";
if (msg.text.indexOf(list_of_specialties) === 0) {
    bot.sendMessage(msg.chat.id, `
ПЕРЕЛІК СПЕЦІАЛЬНОСТЕЙ, ЗА ЯКИМИ ЗДІЙСНЮЄТЬСЯ ПРИЙОМ
КОД 51: ЕКОНОМІКА
Економіка підприємства
Управління персоналом та економіка праці
Міжнародна економіка
Економічна теорія та економічна політика
Економічна кібернетика
Бізнес-статистика і аналітика
КОД 61: ЖУРНАЛІСТИКА
Реклама і зв’язки з громадськістю
Медіа-комунікації
КОД71: ОБЛІК І ОПОДАТКУВАННЯ
Облік і аудит
Фінансово-економічна безпека
Бізнес-консалтинг
Оподаткування
КОД 72: ФІНАНСИ, БАНКІВСЬКА СПРАВА ТА СТРАХУВАННЯ
Фінанси і кредит
Банківська справа
Митна справа
КОД 73: МЕНЕДЖМЕНТ
Менеджмент організацій і адміністрування
Менеджмент інноваційної діяльності
Міжнародний менеджмент
Бізнес-адміністрування
Логістика
КОД 75: МАРКЕТИНГ
Маркетинг
КОД 76: ПІДПРИЄМНИЦТВО, ТОРГІВЛЯ ТА БІРЖОВА ДІЯЛЬНІСТЬ 
Підприємництво
Міжнародна торгівля
КОД 81: ПРАВО
Правове регулювання економіки
КОД 121: ІНЖЕНЕРІЯ ПРОГРАМНОГО ЗАБЕЗПЕЧЕННЯ
Інженерія програмного забезпечення
КОД 122: КОМП’ЮТЕРНІ НАУКИ
Комп’ютерні науки
КОД 124: СИСТЕМНИЙ АНАЛІЗ
Системний аналіз
КОД 125: КІБЕРБЕЗПЕКА
Кібербезпека
КОД 126: ІНФОРМАЦІЙНІ СИСТЕМИ ТА ТЕХНОЛОГІЇ
Інформаційні системи та технології
КОД 186: ВИДАВНИЦТВО ТА ПОЛІГРАФІЯ
Технології електронних мультимедійних видань
Комп’ютерні технології та системи видавничо-поліграфічних виробництв
КОД 232: СОЦІАЛЬНЕ ЗАБЕЗПЕЧЕННЯ
Управління соціальною сферою
КОД 242: ТУРИЗМ
Туризм
`);
}
var list_of_competitive_subjects = "Конкурсні предмети УЦОЯО на бюджет и контракт";
if (msg.text.indexOf(list_of_competitive_subjects) === 0) {
    bot.sendMessage(msg.chat.id, "http://www.hneu.edu.ua/web/public/moved/hneu/Abiturient/Abiturient2018/Konkursni-predmety-2018.pdf");
}
var excerpt_from_the_rules = "Витяг з правил прийому до ХНЕУ ім. С. Кузнеця в 2018 році";
if (msg.text.indexOf(excerpt_from_the_rules) === 0) {
    bot.sendMessage(msg.chat.id, "http://www.hneu.edu.ua/web/public/moved/hneu/Abiturient/Pravila_priema_HNEU/2018/Vytyag-bakalavr-na-osnovi-PZSO.pdf");
}
var reception_education = "Ліцензований обсяг прийому до ХНЕУ";
if (msg.text.indexOf(reception_education) === 0) {
    bot.sendMessage(msg.chat.id, "http://www.hneu.edu.ua/Reception_education_for_a_Bachelor_2016_2017");
}

});

