/**
 * Created by Alika on 30.12.2017.
 */

const TelegramBot = require('node-telegram-bot-api');
const token = '480906268:AAFfbnrcrF7nNJ-rt_753x4Pu0A0DYqDq_c';
const bot = new TelegramBot(token, {polling: true});

bot.onText(/\/start/, (msg) => {
    
bot.sendMessage(msg.chat.id, "Welcome", {
"reply_markup": {
    "keyboard": [["Загальні відомості", "Наша адреса"],   ["Питання"], ["I'm robot"]]
    }
});

bot.sendPhoto(msg.chat.id,"http://www.hneu.edu.ua/web/themes/hneu/images/header/header-down/logo.png" )

});

bot.on('message', (msg) => {

    var hi = "hi";
if (msg.text.toString().toLowerCase().indexOf(hi) === 0) {
    bot.sendMessage(msg.chat.id,"Hello dear user");
}

var bye = "bye";
if (msg.text.toString().toLowerCase().includes(bye)) {
    bot.sendMessage(msg.chat.id, "Hope to see you around again , Bye");
}

var contacts = "Наша адреса";
if (msg.text.indexOf(contacts) === 0) {
    bot.sendMessage(msg.chat.id, `
         Participant Identification Code (PIC) S. KUZNETS KhNUE - 941523323
         м. Харків, просп. Науки, 9-А, 61166 Україна

         Факс: (057)702 07 17
         Email: post@hneu.edu.ua
         Email: depnews@hneu.edu.ua 
         Приймальна комісія: (057)702-18-37
    	`);
}
var description = "Загальні відомості";
if (msg.text.indexOf(description) === 0) {
    bot.sendMessage(msg.chat.id, `
Харківський національний економічний університет імені Семена Кузнеця (ХНЕУ ім. С. Кузнеця) – правонаступник Харківського інженерно-економічного інституту – був заснований 22 жовтня 1930 року на базі промислового факультету Харківського інституту народного господарства. Його відкриття було викликано швидким розвитком машинобудівної, металургійної, хімічної, гірничої та інших галузей промисловості України та республік колишнього СРСР і зростанням потреб в економічних кадрах для промислових підприємств.
 
ХІЕІ готував інженерів-економістів для галузей важкої промисловості України: гірничої, металургійної, основної хімічної і коксохімічної, машинобудівної. З 1960-х рр. також фахівців для проектування і обслуговування автоматизованих систем управління виробництвом (АСУП). Розвинена важка промисловість Харківського регіону і Донбасу забезпечувала інституту базу виробничої практики, науково-дослідної роботи, працевлаштування випускників.
 
У 1948/1949 р. розпочато навчання студентів-іноземців з держав Східної Європи, з 1959 р. – громадян КНР; надалі географія прийому охоплювала більш 25 країн світу. У 1948 р. було організовано студентське наукове суспільство.
 
У 1950-і рр. групою вчених ХІЕІ під керівництвом О. Г. Лібермана були здійснені дослідження з вивчення виробництва 25 машинобудівних заводів Харкова і Харківської області. У ході досліджень були вироблені пропозиції, що згодом були покладені в основу економічної реформи 1965 р. (реформа Косигіна – Лібермана).
 
У кінці 1950-х - 1980-х рр. при ХІЕІ створюються спільні з відомствами проблемні науково-дослідні лабораторії. Зростає обсяг прикладних дослідницьких проектів, що виконувалися на замовлення підприємств. У 1970-ті рр. ХІЕІ проводив спільні дослідження та підтримував ділові контакти з більш як 30 науково-дослідними і проектними інститутами, а також іншими ВНЗ, дослідницькими організаціями, відомствами, науково-промисловими об'єднаннями. З 1988 р. розпочато підготовку фахівців для зовнішньоекономічної діяльності.
 
У 1994 році інститут отримав IV рівень державної акредитації вищих навчальних закладів і Постановою Кабінету Міністрів України від 20 квітня 1994 року був перетворений на Харківський державний економічний університет.
 
У 2004 році, відповідно до рішення Державної акредитаційної комісії (протокол №50 від 13.04.2004), університет підтвердив ІV рівень акредитації. Указом Президента України від 21 серпня 2004 року №956/2004 університету надано статус національного.
    	`);
}
var questions = "Питання";
if (msg.text.indexOf(questions) === 0) {
    bot.sendMessage(msg.chat.id, `
         Питання: Якщо я подала копії документів до Вас, чи можу я подати оригінали 26 липня?
         Відповідь: Зарахування проводиться на підставі оригіналів!
         Подати оригінали Ви можете в будь-який момент до зарахування.
         Також ознайомтеся з трьома етапами зарахування.
         Інші питання на сайті ХНЕУ http://www.hneu.edu.ua/Frequently_Asked_Questions

    	`);

}

});

